{"weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"shape": [1, 513, 100], "name": "conv1d/kernel", "dtype": "float32"}, {"shape": [100], "name": "conv1d/bias", "dtype": "float32"}, {"shape": [1, 100, 100], "name": "conv1d_1/kernel", "dtype": "float32"}, {"shape": [100], "name": "conv1d_1/bias", "dtype": "float32"}, {"shape": [1, 100, 100], "name": "conv1d_10/kernel", "dtype": "float32"}, {"shape": [100], "name": "conv1d_10/bias", "dtype": "float32"}, {"shape": [1, 100, 100], "name": "conv1d_11/kernel", "dtype": "float32"}, {"shape": [100], "name": "conv1d_11/bias", "dtype": "float32"}, {"shape": [1, 100, 100], "name": "conv1d_12/kernel", "dtype": "float32"}, {"shape": [100], "name": "conv1d_12/bias", "dtype": "float32"}, {"shape": [1, 100, 100], "name": "conv1d_13/kernel", "dtype": "float32"}, {"shape": [100], "name": "conv1d_13/bias", "dtype": "float32"}, {"shape": [1, 100, 100], "name": "conv1d_14/kernel", "dtype": "float32"}, {"shape": [100], "name": "conv1d_14/bias", "dtype": "float32"}, {"shape": [1, 100, 100], "name": "conv1d_15/kernel", "dtype": "float32"}, {"shape": [100], "name": "conv1d_15/bias", "dtype": "float32"}, {"shape": [1, 100, 128], "name": "conv1d_16/kernel", "dtype": "float32"}, {"shape": [128], "name": "conv1d_16/bias", "dtype": "float32"}, {"shape": [1, 100, 100], "name": "conv1d_2/kernel", "dtype": "float32"}, {"shape": [100], "name": "conv1d_2/bias", "dtype": "float32"}, {"shape": [1, 100, 100], "name": "conv1d_3/kernel", "dtype": "float32"}, {"shape": [100], "name": "conv1d_3/bias", "dtype": "float32"}, {"shape": [1, 100, 100], "name": "conv1d_4/kernel", "dtype": "float32"}, {"shape": [100], "name": "conv1d_4/bias", "dtype": "float32"}, {"shape": [1, 100, 100], "name": "conv1d_5/kernel", "dtype": "float32"}, {"shape": [100], "name": "conv1d_5/bias", "dtype": "float32"}, {"shape": [1, 100, 100], "name": "conv1d_6/kernel", "dtype": "float32"}, {"shape": [100], "name": "conv1d_6/bias", "dtype": "float32"}, {"shape": [1, 100, 100], "name": "conv1d_7/kernel", "dtype": "float32"}, {"shape": [100], "name": "conv1d_7/bias", "dtype": "float32"}, {"shape": [1, 100, 100], "name": "conv1d_8/kernel", "dtype": "float32"}, {"shape": [100], "name": "conv1d_8/bias", "dtype": "float32"}, {"shape": [1, 100, 100], "name": "conv1d_9/kernel", "dtype": "float32"}, {"shape": [100], "name": "conv1d_9/bias", "dtype": "float32"}]}], "modelTopology": {"keras_version": "2.1.6-tf", "backend": "tensorflow", "model_config": {"config": {"input_layers": [["logspectrum", 0, 0]], "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "logspectrum", "config": {"name": "logspectrum", "batch_input_shape": [null, null, 513], "dtype": "float32", "sparse": false}}, {"inbound_nodes": [[["logspectrum", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d", "config": {"filters": 100, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "kernel_regularizer": null, "dilation_rate": [1], "name": "conv1d", "strides": [1], "data_format": "channels_last", "kernel_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "kernel_size": [1], "bias_constraint": null, "activation": "linear", "padding": "same", "use_bias": true, "bias_regularizer": null, "activity_regularizer": null}}, {"inbound_nodes": [[["conv1d", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_1", "config": {"filters": 100, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "kernel_regularizer": null, "dilation_rate": [1], "name": "conv1d_1", "strides": [1], "data_format": "channels_last", "kernel_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "dtype": "float32", "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "kernel_size": [1], "bias_constraint": null, "activation": "selu", "padding": "same", "use_bias": true, "bias_regularizer": null, "activity_regularizer": null}}, {"inbound_nodes": [[["conv1d_1", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_2", "config": {"filters": 100, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "kernel_regularizer": null, "dilation_rate": [1], "name": "conv1d_2", "strides": [1], "data_format": "channels_last", "kernel_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "dtype": "float32", "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "kernel_size": [1], "bias_constraint": null, "activation": "selu", "padding": "same", "use_bias": true, "bias_regularizer": null, "activity_regularizer": null}}, {"inbound_nodes": [[["conv1d", 0, 0, {}], ["conv1d_2", 0, 0, {}]]], "class_name": "Add", "name": "add", "config": {"trainable": true, "dtype": "float32", "name": "add"}}, {"inbound_nodes": [[["add", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_3", "config": {"filters": 100, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "kernel_regularizer": null, "dilation_rate": [1], "name": "conv1d_3", "strides": [1], "data_format": "channels_last", "kernel_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "dtype": "float32", "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "kernel_size": [1], "bias_constraint": null, "activation": "selu", "padding": "same", "use_bias": true, "bias_regularizer": null, "activity_regularizer": null}}, {"inbound_nodes": [[["conv1d_3", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_4", "config": {"filters": 100, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "kernel_regularizer": null, "dilation_rate": [1], "name": "conv1d_4", "strides": [1], "data_format": "channels_last", "kernel_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "dtype": "float32", "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "kernel_size": [1], "bias_constraint": null, "activation": "selu", "padding": "same", "use_bias": true, "bias_regularizer": null, "activity_regularizer": null}}, {"inbound_nodes": [[["add", 0, 0, {}], ["conv1d_4", 0, 0, {}]]], "class_name": "Add", "name": "add_1", "config": {"trainable": true, "dtype": "float32", "name": "add_1"}}, {"inbound_nodes": [[["add_1", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_5", "config": {"filters": 100, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "kernel_regularizer": null, "dilation_rate": [1], "name": "conv1d_5", "strides": [1], "data_format": "channels_last", "kernel_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "dtype": "float32", "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "kernel_size": [1], "bias_constraint": null, "activation": "selu", "padding": "same", "use_bias": true, "bias_regularizer": null, "activity_regularizer": null}}, {"inbound_nodes": [[["conv1d_5", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_6", "config": {"filters": 100, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "kernel_regularizer": null, "dilation_rate": [1], "name": "conv1d_6", "strides": [1], "data_format": "channels_last", "kernel_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "dtype": "float32", "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "kernel_size": [1], "bias_constraint": null, "activation": "selu", "padding": "same", "use_bias": true, "bias_regularizer": null, "activity_regularizer": null}}, {"inbound_nodes": [[["add_1", 0, 0, {}], ["conv1d_6", 0, 0, {}]]], "class_name": "Add", "name": "add_2", "config": {"trainable": true, "dtype": "float32", "name": "add_2"}}, {"inbound_nodes": [[["add_2", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_7", "config": {"filters": 100, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "kernel_regularizer": null, "dilation_rate": [1], "name": "conv1d_7", "strides": [1], "data_format": "channels_last", "kernel_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "dtype": "float32", "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "kernel_size": [1], "bias_constraint": null, "activation": "selu", "padding": "same", "use_bias": true, "bias_regularizer": null, "activity_regularizer": null}}, {"inbound_nodes": [[["conv1d_7", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_8", "config": {"filters": 100, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "kernel_regularizer": null, "dilation_rate": [1], "name": "conv1d_8", "strides": [1], "data_format": "channels_last", "kernel_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "dtype": "float32", "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "kernel_size": [1], "bias_constraint": null, "activation": "selu", "padding": "same", "use_bias": true, "bias_regularizer": null, "activity_regularizer": null}}, {"inbound_nodes": [[["add_2", 0, 0, {}], ["conv1d_8", 0, 0, {}]]], "class_name": "Add", "name": "add_3", "config": {"trainable": true, "dtype": "float32", "name": "add_3"}}, {"inbound_nodes": [[["add_3", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_9", "config": {"filters": 100, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "kernel_regularizer": null, "dilation_rate": [1], "name": "conv1d_9", "strides": [1], "data_format": "channels_last", "kernel_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "dtype": "float32", "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "kernel_size": [1], "bias_constraint": null, "activation": "selu", "padding": "same", "use_bias": true, "bias_regularizer": null, "activity_regularizer": null}}, {"inbound_nodes": [[["conv1d_9", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_10", "config": {"filters": 100, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "kernel_regularizer": null, "dilation_rate": [1], "name": "conv1d_10", "strides": [1], "data_format": "channels_last", "kernel_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "dtype": "float32", "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "kernel_size": [1], "bias_constraint": null, "activation": "selu", "padding": "same", "use_bias": true, "bias_regularizer": null, "activity_regularizer": null}}, {"inbound_nodes": [[["add_3", 0, 0, {}], ["conv1d_10", 0, 0, {}]]], "class_name": "Add", "name": "add_4", "config": {"trainable": true, "dtype": "float32", "name": "add_4"}}, {"inbound_nodes": [[["add_4", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_11", "config": {"filters": 100, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "kernel_regularizer": null, "dilation_rate": [1], "name": "conv1d_11", "strides": [1], "data_format": "channels_last", "kernel_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "dtype": "float32", "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "kernel_size": [1], "bias_constraint": null, "activation": "selu", "padding": "same", "use_bias": true, "bias_regularizer": null, "activity_regularizer": null}}, {"inbound_nodes": [[["conv1d_11", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_12", "config": {"filters": 100, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "kernel_regularizer": null, "dilation_rate": [1], "name": "conv1d_12", "strides": [1], "data_format": "channels_last", "kernel_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "dtype": "float32", "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "kernel_size": [1], "bias_constraint": null, "activation": "selu", "padding": "same", "use_bias": true, "bias_regularizer": null, "activity_regularizer": null}}, {"inbound_nodes": [[["add_4", 0, 0, {}], ["conv1d_12", 0, 0, {}]]], "class_name": "Add", "name": "add_5", "config": {"trainable": true, "dtype": "float32", "name": "add_5"}}, {"inbound_nodes": [[["add_5", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_13", "config": {"filters": 100, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "kernel_regularizer": null, "dilation_rate": [1], "name": "conv1d_13", "strides": [1], "data_format": "channels_last", "kernel_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "dtype": "float32", "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "kernel_size": [1], "bias_constraint": null, "activation": "selu", "padding": "same", "use_bias": true, "bias_regularizer": null, "activity_regularizer": null}}, {"inbound_nodes": [[["conv1d_13", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_14", "config": {"filters": 100, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "kernel_regularizer": null, "dilation_rate": [1], "name": "conv1d_14", "strides": [1], "data_format": "channels_last", "kernel_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "dtype": "float32", "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "kernel_size": [1], "bias_constraint": null, "activation": "selu", "padding": "same", "use_bias": true, "bias_regularizer": null, "activity_regularizer": null}}, {"inbound_nodes": [[["add_5", 0, 0, {}], ["conv1d_14", 0, 0, {}]]], "class_name": "Add", "name": "add_6", "config": {"trainable": true, "dtype": "float32", "name": "add_6"}}, {"inbound_nodes": [[["add_6", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_15", "config": {"filters": 100, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "kernel_regularizer": null, "dilation_rate": [1], "name": "conv1d_15", "strides": [1], "data_format": "channels_last", "kernel_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "dtype": "float32", "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "kernel_size": [1], "bias_constraint": null, "activation": "selu", "padding": "same", "use_bias": true, "bias_regularizer": null, "activity_regularizer": null}}, {"inbound_nodes": [[["conv1d_15", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_16", "config": {"filters": 128, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "kernel_regularizer": null, "dilation_rate": [1], "name": "conv1d_16", "strides": [1], "data_format": "channels_last", "kernel_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "kernel_size": [1], "bias_constraint": null, "activation": "linear", "padding": "same", "use_bias": true, "bias_regularizer": null, "activity_regularizer": null}}], "output_layers": [["conv1d_16", 0, 0]], "name": "model"}, "class_name": "Model"}}}