{"weightsManifest": [{"weights": [{"dtype": "float32", "name": "conv1d/kernel", "shape": [1, 513, 200]}, {"dtype": "float32", "name": "conv1d/bias", "shape": [200]}, {"dtype": "float32", "name": "conv1d_1/kernel", "shape": [1, 200, 128]}, {"dtype": "float32", "name": "conv1d_1/bias", "shape": [128]}, {"dtype": "float32", "name": "gru/kernel", "shape": [200, 600]}, {"dtype": "float32", "name": "gru/recurrent_kernel", "shape": [200, 600]}, {"dtype": "float32", "name": "gru/bias", "shape": [600]}, {"dtype": "float32", "name": "gru_1/kernel", "shape": [200, 600]}, {"dtype": "float32", "name": "gru_1/recurrent_kernel", "shape": [200, 600]}, {"dtype": "float32", "name": "gru_1/bias", "shape": [600]}, {"dtype": "float32", "name": "gru_2/kernel", "shape": [200, 600]}, {"dtype": "float32", "name": "gru_2/recurrent_kernel", "shape": [200, 600]}, {"dtype": "float32", "name": "gru_2/bias", "shape": [600]}], "paths": ["group1-shard1of1"]}], "modelTopology": {"model_config": {"class_name": "Model", "config": {"input_layers": [["logspectrum", 0, 0], ["GRUState0", 0, 0], ["GRUState1", 0, 0], ["GRUState2", 0, 0]], "name": "model", "output_layers": [["conv1d_1", 0, 0], ["gru", 0, 1], ["gru_1", 0, 1], ["gru_2", 0, 1]], "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 513], "dtype": "float32", "sparse": false, "name": "logspectrum"}, "name": "logspectrum", "inbound_nodes": []}, {"class_name": "Conv1D", "config": {"kernel_size": [1], "filters": 200, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "dilation_rate": [1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "activity_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "data_format": "channels_last", "strides": [1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "dtype": "float32", "name": "conv1d", "trainable": true}, "name": "conv1d", "inbound_nodes": [[["logspectrum", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 200], "dtype": "float32", "sparse": false, "name": "GRUState0"}, "name": "GRUState0", "inbound_nodes": []}, {"class_name": "GRU", "config": {"recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "dtype": "float32", "seed": null}}, "name": "gru", "units": 200, "go_backwards": false, "implementation": 1, "bias_regularizer": null, "dropout": 0.0, "recurrent_dropout": 0.0, "return_sequences": true, "return_state": true, "use_bias": true, "reset_after": false, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "stateful": false, "activation": "tanh", "activity_regularizer": null, "trainable": true, "recurrent_regularizer": null, "recurrent_constraint": null, "dtype": "float32", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "bias_constraint": null}, "name": "gru", "inbound_nodes": [[["conv1d", 0, 0, {}], ["GRUState0", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 200], "dtype": "float32", "sparse": false, "name": "GRUState1"}, "name": "GRUState1", "inbound_nodes": []}, {"class_name": "GRU", "config": {"recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "dtype": "float32", "seed": null}}, "name": "gru_1", "units": 200, "go_backwards": false, "implementation": 1, "bias_regularizer": null, "dropout": 0.0, "recurrent_dropout": 0.0, "return_sequences": true, "return_state": true, "use_bias": true, "reset_after": false, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "stateful": false, "activation": "tanh", "activity_regularizer": null, "trainable": true, "recurrent_regularizer": null, "recurrent_constraint": null, "dtype": "float32", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "bias_constraint": null}, "name": "gru_1", "inbound_nodes": [[["gru", 0, 0, {}], ["GRUState1", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 200], "dtype": "float32", "sparse": false, "name": "GRUState2"}, "name": "GRUState2", "inbound_nodes": []}, {"class_name": "GRU", "config": {"recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "dtype": "float32", "seed": null}}, "name": "gru_2", "units": 200, "go_backwards": false, "implementation": 1, "bias_regularizer": null, "dropout": 0.0, "recurrent_dropout": 0.0, "return_sequences": true, "return_state": true, "use_bias": true, "reset_after": false, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "stateful": false, "activation": "tanh", "activity_regularizer": null, "trainable": true, "recurrent_regularizer": null, "recurrent_constraint": null, "dtype": "float32", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "bias_constraint": null}, "name": "gru_2", "inbound_nodes": [[["gru_1", 0, 0, {}], ["GRUState2", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"kernel_size": [1], "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "dilation_rate": [1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "activity_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "data_format": "channels_last", "strides": [1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "dtype": "float32", "name": "conv1d_1", "trainable": true}, "name": "conv1d_1", "inbound_nodes": [[["gru_2", 0, 0, {}]]]}]}}, "keras_version": "2.1.6-tf", "backend": "tensorflow"}}