{"modelTopology": {"backend": "tensorflow", "keras_version": "2.1.6-tf", "model_config": {"class_name": "Model", "config": {"output_layers": [["conv1d_16", 0, 0], ["layer_split_head_1", 0, 0], ["layer_split_head_4", 0, 0], ["layer_split_head_7", 0, 0], ["layer_split_head_2", 0, 0], ["layer_split_head_5", 0, 0], ["layer_split_head_8", 0, 0]], "input_layers": [["logspectrum", 0, 0], ["input_1", 0, 0], ["input_2", 0, 0], ["input_4", 0, 0], ["input_6", 0, 0], ["input_3", 0, 0], ["input_5", 0, 0], ["input_7", 0, 0]], "layers": [{"config": {"sparse": false, "dtype": "float32", "name": "logspectrum", "batch_input_shape": [null, null, 513]}, "inbound_nodes": [], "class_name": "InputLayer", "name": "logspectrum"}, {"config": {"use_bias": true, "dilation_rate": [1], "name": "conv1d", "kernel_regularizer": null, "strides": [1], "kernel_size": [1], "filters": 100, "kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "data_format": "channels_last", "bias_regularizer": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "padding": "valid"}, "inbound_nodes": [[["logspectrum", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d"}, {"config": {"sparse": false, "dtype": "int32", "name": "input_1", "batch_input_shape": [null, 1]}, "inbound_nodes": [], "class_name": "InputLayer", "name": "input_1"}, {"config": {"d": 50, "trainable": true, "dtype": "float32", "name": "layer_position_embedding"}, "inbound_nodes": [[["conv1d", 0, 0, {}], ["input_1", 0, 0, {}]]], "class_name": "LayerPositionEmbedding", "name": "layer_position_embedding"}, {"config": {"trainable": true, "dtype": "float32", "name": "add"}, "inbound_nodes": [[["layer_position_embedding", 0, 0, {}], ["conv1d", 0, 0, {}]]], "class_name": "Add", "name": "add"}, {"config": {"use_bias": false, "dilation_rate": [1], "name": "conv1d_2", "kernel_regularizer": null, "strides": [1], "kernel_size": [1], "filters": 80, "kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "data_format": "channels_last", "bias_regularizer": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "padding": "valid"}, "inbound_nodes": [[["add", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_2"}, {"config": {"use_bias": false, "dilation_rate": [1], "name": "conv1d_3", "kernel_regularizer": null, "strides": [1], "kernel_size": [1], "filters": 100, "kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "data_format": "channels_last", "bias_regularizer": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "padding": "valid"}, "inbound_nodes": [[["add", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_3"}, {"config": {"trainable": true, "nbhead": 4, "dtype": "float32", "outdim": 20, "name": "layer_split_head_1"}, "inbound_nodes": [[["conv1d_2", 0, 0, {}]]], "class_name": "LayerSplitHead", "name": "layer_split_head_1"}, {"config": {"trainable": true, "nbhead": 4, "dtype": "float32", "outdim": 25, "name": "layer_split_head_2"}, "inbound_nodes": [[["conv1d_3", 0, 0, {}]]], "class_name": "LayerSplitHead", "name": "layer_split_head_2"}, {"config": {"use_bias": false, "dilation_rate": [1], "name": "conv1d_1", "kernel_regularizer": null, "strides": [1], "kernel_size": [1], "filters": 80, "kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "data_format": "channels_last", "bias_regularizer": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "padding": "valid"}, "inbound_nodes": [[["add", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_1"}, {"config": {"sparse": false, "dtype": "float32", "name": "input_2", "batch_input_shape": [null, 4, null, 20]}, "inbound_nodes": [], "class_name": "InputLayer", "name": "input_2"}, {"config": {"trainable": true, "target_shape": [4, -1, 20], "dtype": "float32", "name": "reshape"}, "inbound_nodes": [[["layer_split_head_1", 0, 0, {}]]], "class_name": "Reshape", "name": "reshape"}, {"config": {"sparse": false, "dtype": "float32", "name": "input_3", "batch_input_shape": [null, 4, null, 25]}, "inbound_nodes": [], "class_name": "InputLayer", "name": "input_3"}, {"config": {"trainable": true, "target_shape": [4, -1, 25], "dtype": "float32", "name": "reshape_1"}, "inbound_nodes": [[["layer_split_head_2", 0, 0, {}]]], "class_name": "Reshape", "name": "reshape_1"}, {"config": {"trainable": true, "nbhead": 4, "dtype": "float32", "outdim": 20, "name": "layer_split_head"}, "inbound_nodes": [[["conv1d_1", 0, 0, {}]]], "class_name": "LayerSplitHead", "name": "layer_split_head"}, {"config": {"trainable": true, "dtype": "float32", "axis": 2, "name": "concatenate"}, "inbound_nodes": [[["input_2", 0, 0, {}], ["reshape", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate"}, {"config": {"trainable": true, "dtype": "float32", "axis": 2, "name": "concatenate_1"}, "inbound_nodes": [[["input_3", 0, 0, {}], ["reshape_1", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_1"}, {"config": {"vdim": 25, "dtype": "float32", "name": "layer_masked_attention", "kdim": 20, "trainable": true, "nbhead": 4, "localAttention": 10}, "inbound_nodes": [[["layer_split_head", 0, 0, {}], ["concatenate", 0, 0, {}], ["concatenate_1", 0, 0, {}]]], "class_name": "LayerMaskedAttention", "name": "layer_masked_attention"}, {"config": {"trainable": true, "dtype": "float32", "name": "add_1"}, "inbound_nodes": [[["add", 0, 0, {}], ["layer_masked_attention", 0, 0, {}]]], "class_name": "Add", "name": "add_1"}, {"config": {"trainable": true, "dtype": "float32", "axis": -1, "name": "layer_norm"}, "inbound_nodes": [[["add_1", 0, 0, {}]]], "class_name": "LayerNorm", "name": "layer_norm"}, {"config": {"use_bias": true, "dilation_rate": [1], "name": "conv1d_4", "kernel_regularizer": null, "strides": [1], "kernel_size": [1], "filters": 100, "kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "data_format": "channels_last", "bias_regularizer": null, "activation": "selu", "trainable": true, "activity_regularizer": null, "padding": "valid"}, "inbound_nodes": [[["layer_norm", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_4"}, {"config": {"use_bias": true, "dilation_rate": [1], "name": "conv1d_5", "kernel_regularizer": null, "strides": [1], "kernel_size": [1], "filters": 100, "kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "data_format": "channels_last", "bias_regularizer": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "padding": "valid"}, "inbound_nodes": [[["conv1d_4", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_5"}, {"config": {"trainable": true, "dtype": "float32", "name": "add_2"}, "inbound_nodes": [[["layer_norm", 0, 0, {}], ["conv1d_5", 0, 0, {}]]], "class_name": "Add", "name": "add_2"}, {"config": {"trainable": true, "dtype": "float32", "axis": -1, "name": "layer_norm_1"}, "inbound_nodes": [[["add_2", 0, 0, {}]]], "class_name": "LayerNorm", "name": "layer_norm_1"}, {"config": {"use_bias": false, "dilation_rate": [1], "name": "conv1d_7", "kernel_regularizer": null, "strides": [1], "kernel_size": [1], "filters": 80, "kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "data_format": "channels_last", "bias_regularizer": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "padding": "valid"}, "inbound_nodes": [[["layer_norm_1", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_7"}, {"config": {"use_bias": false, "dilation_rate": [1], "name": "conv1d_8", "kernel_regularizer": null, "strides": [1], "kernel_size": [1], "filters": 100, "kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "data_format": "channels_last", "bias_regularizer": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "padding": "valid"}, "inbound_nodes": [[["layer_norm_1", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_8"}, {"config": {"trainable": true, "nbhead": 4, "dtype": "float32", "outdim": 20, "name": "layer_split_head_4"}, "inbound_nodes": [[["conv1d_7", 0, 0, {}]]], "class_name": "LayerSplitHead", "name": "layer_split_head_4"}, {"config": {"trainable": true, "nbhead": 4, "dtype": "float32", "outdim": 25, "name": "layer_split_head_5"}, "inbound_nodes": [[["conv1d_8", 0, 0, {}]]], "class_name": "LayerSplitHead", "name": "layer_split_head_5"}, {"config": {"use_bias": false, "dilation_rate": [1], "name": "conv1d_6", "kernel_regularizer": null, "strides": [1], "kernel_size": [1], "filters": 80, "kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "data_format": "channels_last", "bias_regularizer": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "padding": "valid"}, "inbound_nodes": [[["layer_norm_1", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_6"}, {"config": {"sparse": false, "dtype": "float32", "name": "input_4", "batch_input_shape": [null, 4, null, 20]}, "inbound_nodes": [], "class_name": "InputLayer", "name": "input_4"}, {"config": {"trainable": true, "target_shape": [4, -1, 20], "dtype": "float32", "name": "reshape_2"}, "inbound_nodes": [[["layer_split_head_4", 0, 0, {}]]], "class_name": "Reshape", "name": "reshape_2"}, {"config": {"sparse": false, "dtype": "float32", "name": "input_5", "batch_input_shape": [null, 4, null, 25]}, "inbound_nodes": [], "class_name": "InputLayer", "name": "input_5"}, {"config": {"trainable": true, "target_shape": [4, -1, 25], "dtype": "float32", "name": "reshape_3"}, "inbound_nodes": [[["layer_split_head_5", 0, 0, {}]]], "class_name": "Reshape", "name": "reshape_3"}, {"config": {"trainable": true, "nbhead": 4, "dtype": "float32", "outdim": 20, "name": "layer_split_head_3"}, "inbound_nodes": [[["conv1d_6", 0, 0, {}]]], "class_name": "LayerSplitHead", "name": "layer_split_head_3"}, {"config": {"trainable": true, "dtype": "float32", "axis": 2, "name": "concatenate_2"}, "inbound_nodes": [[["input_4", 0, 0, {}], ["reshape_2", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_2"}, {"config": {"trainable": true, "dtype": "float32", "axis": 2, "name": "concatenate_3"}, "inbound_nodes": [[["input_5", 0, 0, {}], ["reshape_3", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_3"}, {"config": {"vdim": 25, "dtype": "float32", "name": "layer_masked_attention_1", "kdim": 20, "trainable": true, "nbhead": 4, "localAttention": 10}, "inbound_nodes": [[["layer_split_head_3", 0, 0, {}], ["concatenate_2", 0, 0, {}], ["concatenate_3", 0, 0, {}]]], "class_name": "LayerMaskedAttention", "name": "layer_masked_attention_1"}, {"config": {"trainable": true, "dtype": "float32", "name": "add_3"}, "inbound_nodes": [[["layer_norm_1", 0, 0, {}], ["layer_masked_attention_1", 0, 0, {}]]], "class_name": "Add", "name": "add_3"}, {"config": {"trainable": true, "dtype": "float32", "axis": -1, "name": "layer_norm_2"}, "inbound_nodes": [[["add_3", 0, 0, {}]]], "class_name": "LayerNorm", "name": "layer_norm_2"}, {"config": {"use_bias": true, "dilation_rate": [1], "name": "conv1d_9", "kernel_regularizer": null, "strides": [1], "kernel_size": [1], "filters": 100, "kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "data_format": "channels_last", "bias_regularizer": null, "activation": "selu", "trainable": true, "activity_regularizer": null, "padding": "valid"}, "inbound_nodes": [[["layer_norm_2", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_9"}, {"config": {"use_bias": true, "dilation_rate": [1], "name": "conv1d_10", "kernel_regularizer": null, "strides": [1], "kernel_size": [1], "filters": 100, "kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "data_format": "channels_last", "bias_regularizer": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "padding": "valid"}, "inbound_nodes": [[["conv1d_9", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_10"}, {"config": {"trainable": true, "dtype": "float32", "name": "add_4"}, "inbound_nodes": [[["layer_norm_2", 0, 0, {}], ["conv1d_10", 0, 0, {}]]], "class_name": "Add", "name": "add_4"}, {"config": {"trainable": true, "dtype": "float32", "axis": -1, "name": "layer_norm_3"}, "inbound_nodes": [[["add_4", 0, 0, {}]]], "class_name": "LayerNorm", "name": "layer_norm_3"}, {"config": {"use_bias": false, "dilation_rate": [1], "name": "conv1d_12", "kernel_regularizer": null, "strides": [1], "kernel_size": [1], "filters": 80, "kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "data_format": "channels_last", "bias_regularizer": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "padding": "valid"}, "inbound_nodes": [[["layer_norm_3", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_12"}, {"config": {"use_bias": false, "dilation_rate": [1], "name": "conv1d_13", "kernel_regularizer": null, "strides": [1], "kernel_size": [1], "filters": 100, "kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "data_format": "channels_last", "bias_regularizer": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "padding": "valid"}, "inbound_nodes": [[["layer_norm_3", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_13"}, {"config": {"trainable": true, "nbhead": 4, "dtype": "float32", "outdim": 20, "name": "layer_split_head_7"}, "inbound_nodes": [[["conv1d_12", 0, 0, {}]]], "class_name": "LayerSplitHead", "name": "layer_split_head_7"}, {"config": {"trainable": true, "nbhead": 4, "dtype": "float32", "outdim": 25, "name": "layer_split_head_8"}, "inbound_nodes": [[["conv1d_13", 0, 0, {}]]], "class_name": "LayerSplitHead", "name": "layer_split_head_8"}, {"config": {"use_bias": false, "dilation_rate": [1], "name": "conv1d_11", "kernel_regularizer": null, "strides": [1], "kernel_size": [1], "filters": 80, "kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "data_format": "channels_last", "bias_regularizer": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "padding": "valid"}, "inbound_nodes": [[["layer_norm_3", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_11"}, {"config": {"sparse": false, "dtype": "float32", "name": "input_6", "batch_input_shape": [null, 4, null, 20]}, "inbound_nodes": [], "class_name": "InputLayer", "name": "input_6"}, {"config": {"trainable": true, "target_shape": [4, -1, 20], "dtype": "float32", "name": "reshape_4"}, "inbound_nodes": [[["layer_split_head_7", 0, 0, {}]]], "class_name": "Reshape", "name": "reshape_4"}, {"config": {"sparse": false, "dtype": "float32", "name": "input_7", "batch_input_shape": [null, 4, null, 25]}, "inbound_nodes": [], "class_name": "InputLayer", "name": "input_7"}, {"config": {"trainable": true, "target_shape": [4, -1, 25], "dtype": "float32", "name": "reshape_5"}, "inbound_nodes": [[["layer_split_head_8", 0, 0, {}]]], "class_name": "Reshape", "name": "reshape_5"}, {"config": {"trainable": true, "nbhead": 4, "dtype": "float32", "outdim": 20, "name": "layer_split_head_6"}, "inbound_nodes": [[["conv1d_11", 0, 0, {}]]], "class_name": "LayerSplitHead", "name": "layer_split_head_6"}, {"config": {"trainable": true, "dtype": "float32", "axis": 2, "name": "concatenate_4"}, "inbound_nodes": [[["input_6", 0, 0, {}], ["reshape_4", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_4"}, {"config": {"trainable": true, "dtype": "float32", "axis": 2, "name": "concatenate_5"}, "inbound_nodes": [[["input_7", 0, 0, {}], ["reshape_5", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_5"}, {"config": {"vdim": 25, "dtype": "float32", "name": "layer_masked_attention_2", "kdim": 20, "trainable": true, "nbhead": 4, "localAttention": 10}, "inbound_nodes": [[["layer_split_head_6", 0, 0, {}], ["concatenate_4", 0, 0, {}], ["concatenate_5", 0, 0, {}]]], "class_name": "LayerMaskedAttention", "name": "layer_masked_attention_2"}, {"config": {"trainable": true, "dtype": "float32", "name": "add_5"}, "inbound_nodes": [[["layer_norm_3", 0, 0, {}], ["layer_masked_attention_2", 0, 0, {}]]], "class_name": "Add", "name": "add_5"}, {"config": {"trainable": true, "dtype": "float32", "axis": -1, "name": "layer_norm_4"}, "inbound_nodes": [[["add_5", 0, 0, {}]]], "class_name": "LayerNorm", "name": "layer_norm_4"}, {"config": {"use_bias": true, "dilation_rate": [1], "name": "conv1d_14", "kernel_regularizer": null, "strides": [1], "kernel_size": [1], "filters": 100, "kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "data_format": "channels_last", "bias_regularizer": null, "activation": "selu", "trainable": true, "activity_regularizer": null, "padding": "valid"}, "inbound_nodes": [[["layer_norm_4", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_14"}, {"config": {"use_bias": true, "dilation_rate": [1], "name": "conv1d_15", "kernel_regularizer": null, "strides": [1], "kernel_size": [1], "filters": 100, "kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "data_format": "channels_last", "bias_regularizer": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "padding": "valid"}, "inbound_nodes": [[["conv1d_14", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_15"}, {"config": {"trainable": true, "dtype": "float32", "name": "add_6"}, "inbound_nodes": [[["layer_norm_4", 0, 0, {}], ["conv1d_15", 0, 0, {}]]], "class_name": "Add", "name": "add_6"}, {"config": {"trainable": true, "dtype": "float32", "axis": -1, "name": "layer_norm_5"}, "inbound_nodes": [[["add_6", 0, 0, {}]]], "class_name": "LayerNorm", "name": "layer_norm_5"}, {"config": {"use_bias": true, "dilation_rate": [1], "name": "conv1d_16", "kernel_regularizer": null, "strides": [1], "kernel_size": [1], "filters": 128, "kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "data_format": "channels_last", "bias_regularizer": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "padding": "valid"}, "inbound_nodes": [[["layer_norm_5", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_16"}], "name": "model"}}}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"shape": [1, 513, 100], "dtype": "float32", "name": "conv1d/kernel"}, {"shape": [100], "dtype": "float32", "name": "conv1d/bias"}, {"shape": [1, 100, 80], "dtype": "float32", "name": "conv1d_1/kernel"}, {"shape": [1, 100, 100], "dtype": "float32", "name": "conv1d_10/kernel"}, {"shape": [100], "dtype": "float32", "name": "conv1d_10/bias"}, {"shape": [1, 100, 80], "dtype": "float32", "name": "conv1d_11/kernel"}, {"shape": [1, 100, 80], "dtype": "float32", "name": "conv1d_12/kernel"}, {"shape": [1, 100, 100], "dtype": "float32", "name": "conv1d_13/kernel"}, {"shape": [1, 100, 100], "dtype": "float32", "name": "conv1d_14/kernel"}, {"shape": [100], "dtype": "float32", "name": "conv1d_14/bias"}, {"shape": [1, 100, 100], "dtype": "float32", "name": "conv1d_15/kernel"}, {"shape": [100], "dtype": "float32", "name": "conv1d_15/bias"}, {"shape": [1, 100, 128], "dtype": "float32", "name": "conv1d_16/kernel"}, {"shape": [128], "dtype": "float32", "name": "conv1d_16/bias"}, {"shape": [1, 100, 80], "dtype": "float32", "name": "conv1d_2/kernel"}, {"shape": [1, 100, 100], "dtype": "float32", "name": "conv1d_3/kernel"}, {"shape": [1, 100, 100], "dtype": "float32", "name": "conv1d_4/kernel"}, {"shape": [100], "dtype": "float32", "name": "conv1d_4/bias"}, {"shape": [1, 100, 100], "dtype": "float32", "name": "conv1d_5/kernel"}, {"shape": [100], "dtype": "float32", "name": "conv1d_5/bias"}, {"shape": [1, 100, 80], "dtype": "float32", "name": "conv1d_6/kernel"}, {"shape": [1, 100, 80], "dtype": "float32", "name": "conv1d_7/kernel"}, {"shape": [1, 100, 100], "dtype": "float32", "name": "conv1d_8/kernel"}, {"shape": [1, 100, 100], "dtype": "float32", "name": "conv1d_9/kernel"}, {"shape": [100], "dtype": "float32", "name": "conv1d_9/bias"}, {"shape": [100], "dtype": "float32", "name": "layer_norm/g"}, {"shape": [100], "dtype": "float32", "name": "layer_norm/b"}, {"shape": [100], "dtype": "float32", "name": "layer_norm_1/g"}, {"shape": [100], "dtype": "float32", "name": "layer_norm_1/b"}, {"shape": [100], "dtype": "float32", "name": "layer_norm_2/g"}, {"shape": [100], "dtype": "float32", "name": "layer_norm_2/b"}, {"shape": [100], "dtype": "float32", "name": "layer_norm_3/g"}, {"shape": [100], "dtype": "float32", "name": "layer_norm_3/b"}, {"shape": [100], "dtype": "float32", "name": "layer_norm_4/g"}, {"shape": [100], "dtype": "float32", "name": "layer_norm_4/b"}, {"shape": [100], "dtype": "float32", "name": "layer_norm_5/g"}, {"shape": [100], "dtype": "float32", "name": "layer_norm_5/b"}]}]}