{"modelTopology": {"model_config": {"class_name": "Model", "config": {"input_layers": [["logspectrum", 0, 0]], "name": "model", "layers": [{"inbound_nodes": [], "name": "logspectrum", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 513], "name": "logspectrum", "sparse": false, "dtype": "float32"}}, {"inbound_nodes": [[["logspectrum", 0, 0, {}]]], "name": "conv1d", "class_name": "Conv1D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "trainable": true, "data_format": "channels_last", "use_bias": true, "activation": "linear", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "dilation_rate": [1], "kernel_constraint": null, "bias_constraint": null, "name": "conv1d", "strides": [1], "kernel_size": [1], "padding": "same", "filters": 300, "activity_regularizer": null, "dtype": "float32", "bias_regularizer": null}}, {"inbound_nodes": [[["conv1d", 0, 0, {}]]], "name": "conv1d_1", "class_name": "Conv1D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "trainable": true, "data_format": "channels_last", "use_bias": true, "activation": "selu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "dtype": "float32", "distribution": "normal"}}, "dilation_rate": [1], "kernel_constraint": null, "bias_constraint": null, "name": "conv1d_1", "strides": [1], "kernel_size": [1], "padding": "same", "filters": 300, "activity_regularizer": null, "dtype": "float32", "bias_regularizer": null}}, {"inbound_nodes": [[["conv1d_1", 0, 0, {}]]], "name": "conv1d_2", "class_name": "Conv1D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "trainable": true, "data_format": "channels_last", "use_bias": true, "activation": "selu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "dtype": "float32", "distribution": "normal"}}, "dilation_rate": [1], "kernel_constraint": null, "bias_constraint": null, "name": "conv1d_2", "strides": [1], "kernel_size": [1], "padding": "same", "filters": 300, "activity_regularizer": null, "dtype": "float32", "bias_regularizer": null}}, {"inbound_nodes": [[["conv1d", 0, 0, {}], ["conv1d_2", 0, 0, {}]]], "name": "add", "class_name": "Add", "config": {"trainable": true, "name": "add", "dtype": "float32"}}, {"inbound_nodes": [[["add", 0, 0, {}]]], "name": "conv1d_3", "class_name": "Conv1D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "trainable": true, "data_format": "channels_last", "use_bias": true, "activation": "selu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "dtype": "float32", "distribution": "normal"}}, "dilation_rate": [1], "kernel_constraint": null, "bias_constraint": null, "name": "conv1d_3", "strides": [1], "kernel_size": [1], "padding": "same", "filters": 300, "activity_regularizer": null, "dtype": "float32", "bias_regularizer": null}}, {"inbound_nodes": [[["conv1d_3", 0, 0, {}]]], "name": "conv1d_4", "class_name": "Conv1D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "trainable": true, "data_format": "channels_last", "use_bias": true, "activation": "selu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "dtype": "float32", "distribution": "normal"}}, "dilation_rate": [1], "kernel_constraint": null, "bias_constraint": null, "name": "conv1d_4", "strides": [1], "kernel_size": [1], "padding": "same", "filters": 300, "activity_regularizer": null, "dtype": "float32", "bias_regularizer": null}}, {"inbound_nodes": [[["add", 0, 0, {}], ["conv1d_4", 0, 0, {}]]], "name": "add_1", "class_name": "Add", "config": {"trainable": true, "name": "add_1", "dtype": "float32"}}, {"inbound_nodes": [[["add_1", 0, 0, {}]]], "name": "conv1d_5", "class_name": "Conv1D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "trainable": true, "data_format": "channels_last", "use_bias": true, "activation": "selu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "dtype": "float32", "distribution": "normal"}}, "dilation_rate": [1], "kernel_constraint": null, "bias_constraint": null, "name": "conv1d_5", "strides": [1], "kernel_size": [1], "padding": "same", "filters": 300, "activity_regularizer": null, "dtype": "float32", "bias_regularizer": null}}, {"inbound_nodes": [[["conv1d_5", 0, 0, {}]]], "name": "conv1d_6", "class_name": "Conv1D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "trainable": true, "data_format": "channels_last", "use_bias": true, "activation": "selu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "dtype": "float32", "distribution": "normal"}}, "dilation_rate": [1], "kernel_constraint": null, "bias_constraint": null, "name": "conv1d_6", "strides": [1], "kernel_size": [1], "padding": "same", "filters": 300, "activity_regularizer": null, "dtype": "float32", "bias_regularizer": null}}, {"inbound_nodes": [[["add_1", 0, 0, {}], ["conv1d_6", 0, 0, {}]]], "name": "add_2", "class_name": "Add", "config": {"trainable": true, "name": "add_2", "dtype": "float32"}}, {"inbound_nodes": [[["add_2", 0, 0, {}]]], "name": "conv1d_7", "class_name": "Conv1D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "trainable": true, "data_format": "channels_last", "use_bias": true, "activation": "selu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "dtype": "float32", "distribution": "normal"}}, "dilation_rate": [1], "kernel_constraint": null, "bias_constraint": null, "name": "conv1d_7", "strides": [1], "kernel_size": [1], "padding": "same", "filters": 300, "activity_regularizer": null, "dtype": "float32", "bias_regularizer": null}}, {"inbound_nodes": [[["conv1d_7", 0, 0, {}]]], "name": "conv1d_8", "class_name": "Conv1D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "trainable": true, "data_format": "channels_last", "use_bias": true, "activation": "selu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "dtype": "float32", "distribution": "normal"}}, "dilation_rate": [1], "kernel_constraint": null, "bias_constraint": null, "name": "conv1d_8", "strides": [1], "kernel_size": [1], "padding": "same", "filters": 300, "activity_regularizer": null, "dtype": "float32", "bias_regularizer": null}}, {"inbound_nodes": [[["add_2", 0, 0, {}], ["conv1d_8", 0, 0, {}]]], "name": "add_3", "class_name": "Add", "config": {"trainable": true, "name": "add_3", "dtype": "float32"}}, {"inbound_nodes": [[["add_3", 0, 0, {}]]], "name": "conv1d_9", "class_name": "Conv1D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "trainable": true, "data_format": "channels_last", "use_bias": true, "activation": "selu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "dtype": "float32", "distribution": "normal"}}, "dilation_rate": [1], "kernel_constraint": null, "bias_constraint": null, "name": "conv1d_9", "strides": [1], "kernel_size": [1], "padding": "same", "filters": 300, "activity_regularizer": null, "dtype": "float32", "bias_regularizer": null}}, {"inbound_nodes": [[["conv1d_9", 0, 0, {}]]], "name": "conv1d_10", "class_name": "Conv1D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "trainable": true, "data_format": "channels_last", "use_bias": true, "activation": "selu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "dtype": "float32", "distribution": "normal"}}, "dilation_rate": [1], "kernel_constraint": null, "bias_constraint": null, "name": "conv1d_10", "strides": [1], "kernel_size": [1], "padding": "same", "filters": 300, "activity_regularizer": null, "dtype": "float32", "bias_regularizer": null}}, {"inbound_nodes": [[["add_3", 0, 0, {}], ["conv1d_10", 0, 0, {}]]], "name": "add_4", "class_name": "Add", "config": {"trainable": true, "name": "add_4", "dtype": "float32"}}, {"inbound_nodes": [[["add_4", 0, 0, {}]]], "name": "conv1d_11", "class_name": "Conv1D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "trainable": true, "data_format": "channels_last", "use_bias": true, "activation": "selu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "dtype": "float32", "distribution": "normal"}}, "dilation_rate": [1], "kernel_constraint": null, "bias_constraint": null, "name": "conv1d_11", "strides": [1], "kernel_size": [1], "padding": "same", "filters": 300, "activity_regularizer": null, "dtype": "float32", "bias_regularizer": null}}, {"inbound_nodes": [[["conv1d_11", 0, 0, {}]]], "name": "conv1d_12", "class_name": "Conv1D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "trainable": true, "data_format": "channels_last", "use_bias": true, "activation": "selu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "dtype": "float32", "distribution": "normal"}}, "dilation_rate": [1], "kernel_constraint": null, "bias_constraint": null, "name": "conv1d_12", "strides": [1], "kernel_size": [1], "padding": "same", "filters": 300, "activity_regularizer": null, "dtype": "float32", "bias_regularizer": null}}, {"inbound_nodes": [[["add_4", 0, 0, {}], ["conv1d_12", 0, 0, {}]]], "name": "add_5", "class_name": "Add", "config": {"trainable": true, "name": "add_5", "dtype": "float32"}}, {"inbound_nodes": [[["add_5", 0, 0, {}]]], "name": "conv1d_13", "class_name": "Conv1D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "trainable": true, "data_format": "channels_last", "use_bias": true, "activation": "selu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "dtype": "float32", "distribution": "normal"}}, "dilation_rate": [1], "kernel_constraint": null, "bias_constraint": null, "name": "conv1d_13", "strides": [1], "kernel_size": [1], "padding": "same", "filters": 300, "activity_regularizer": null, "dtype": "float32", "bias_regularizer": null}}, {"inbound_nodes": [[["conv1d_13", 0, 0, {}]]], "name": "conv1d_14", "class_name": "Conv1D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "trainable": true, "data_format": "channels_last", "use_bias": true, "activation": "selu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "dtype": "float32", "distribution": "normal"}}, "dilation_rate": [1], "kernel_constraint": null, "bias_constraint": null, "name": "conv1d_14", "strides": [1], "kernel_size": [1], "padding": "same", "filters": 300, "activity_regularizer": null, "dtype": "float32", "bias_regularizer": null}}, {"inbound_nodes": [[["add_5", 0, 0, {}], ["conv1d_14", 0, 0, {}]]], "name": "add_6", "class_name": "Add", "config": {"trainable": true, "name": "add_6", "dtype": "float32"}}, {"inbound_nodes": [[["add_6", 0, 0, {}]]], "name": "conv1d_15", "class_name": "Conv1D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "trainable": true, "data_format": "channels_last", "use_bias": true, "activation": "selu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "dtype": "float32", "distribution": "normal"}}, "dilation_rate": [1], "kernel_constraint": null, "bias_constraint": null, "name": "conv1d_15", "strides": [1], "kernel_size": [1], "padding": "same", "filters": 300, "activity_regularizer": null, "dtype": "float32", "bias_regularizer": null}}, {"inbound_nodes": [[["conv1d_15", 0, 0, {}]]], "name": "conv1d_16", "class_name": "Conv1D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "trainable": true, "data_format": "channels_last", "use_bias": true, "activation": "linear", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "dilation_rate": [1], "kernel_constraint": null, "bias_constraint": null, "name": "conv1d_16", "strides": [1], "kernel_size": [1], "padding": "same", "filters": 128, "activity_regularizer": null, "dtype": "float32", "bias_regularizer": null}}], "output_layers": [["conv1d_16", 0, 0]]}}, "keras_version": "2.1.6-tf", "backend": "tensorflow"}, "weightsManifest": [{"paths": ["group1-shard1of2", "group1-shard2of2"], "weights": [{"shape": [1, 513, 300], "name": "conv1d/kernel", "dtype": "float32"}, {"shape": [300], "name": "conv1d/bias", "dtype": "float32"}, {"shape": [1, 300, 300], "name": "conv1d_1/kernel", "dtype": "float32"}, {"shape": [300], "name": "conv1d_1/bias", "dtype": "float32"}, {"shape": [1, 300, 300], "name": "conv1d_10/kernel", "dtype": "float32"}, {"shape": [300], "name": "conv1d_10/bias", "dtype": "float32"}, {"shape": [1, 300, 300], "name": "conv1d_11/kernel", "dtype": "float32"}, {"shape": [300], "name": "conv1d_11/bias", "dtype": "float32"}, {"shape": [1, 300, 300], "name": "conv1d_12/kernel", "dtype": "float32"}, {"shape": [300], "name": "conv1d_12/bias", "dtype": "float32"}, {"shape": [1, 300, 300], "name": "conv1d_13/kernel", "dtype": "float32"}, {"shape": [300], "name": "conv1d_13/bias", "dtype": "float32"}, {"shape": [1, 300, 300], "name": "conv1d_14/kernel", "dtype": "float32"}, {"shape": [300], "name": "conv1d_14/bias", "dtype": "float32"}, {"shape": [1, 300, 300], "name": "conv1d_15/kernel", "dtype": "float32"}, {"shape": [300], "name": "conv1d_15/bias", "dtype": "float32"}, {"shape": [1, 300, 128], "name": "conv1d_16/kernel", "dtype": "float32"}, {"shape": [128], "name": "conv1d_16/bias", "dtype": "float32"}, {"shape": [1, 300, 300], "name": "conv1d_2/kernel", "dtype": "float32"}, {"shape": [300], "name": "conv1d_2/bias", "dtype": "float32"}, {"shape": [1, 300, 300], "name": "conv1d_3/kernel", "dtype": "float32"}, {"shape": [300], "name": "conv1d_3/bias", "dtype": "float32"}, {"shape": [1, 300, 300], "name": "conv1d_4/kernel", "dtype": "float32"}, {"shape": [300], "name": "conv1d_4/bias", "dtype": "float32"}, {"shape": [1, 300, 300], "name": "conv1d_5/kernel", "dtype": "float32"}, {"shape": [300], "name": "conv1d_5/bias", "dtype": "float32"}, {"shape": [1, 300, 300], "name": "conv1d_6/kernel", "dtype": "float32"}, {"shape": [300], "name": "conv1d_6/bias", "dtype": "float32"}, {"shape": [1, 300, 300], "name": "conv1d_7/kernel", "dtype": "float32"}, {"shape": [300], "name": "conv1d_7/bias", "dtype": "float32"}, {"shape": [1, 300, 300], "name": "conv1d_8/kernel", "dtype": "float32"}, {"shape": [300], "name": "conv1d_8/bias", "dtype": "float32"}, {"shape": [1, 300, 300], "name": "conv1d_9/kernel", "dtype": "float32"}, {"shape": [300], "name": "conv1d_9/bias", "dtype": "float32"}]}]}